"WSAppID" = "1";

"Version %@" = "Version %@";

// Keyboard char substitutes
"key:[ ]" = "space";
"keyFontSize:[ ]" = "18";
"keyFontColor:[ ]" = "0.2,0.2,0.3,1.0";

"key:[DONE]" = "Done";
"key:[DONE2]" = "Done";
"keyFontSize:[DONE]" = "18";
//"keyFontColor:[DONE]" = "0.18,0.424,0.914,1.0";
"keyFontColor:[DONE]" = "1.0,1.0,1.0,1.0";
"keyFontShadowColor:[DONE]" = "0.0,0.0,0.0,0.25";

"Back" = "Back";
"Done" = "Done";
"Menu" = "Menu";
"Clear" = "Clear";
"Cancel" = "Cancel";
"Save" = "Save";
"OK" = "OK";
"YES" = "YES";
"NO" = "NO";

"Are you checking out?" = "Are you checking out?";

"Swipe card when ready." = "Swipe card when ready.";
"Processing Credit Card" = "Processing Credit Card";
"Receipt" = "Receipt";

"Deactivate" = "Deactivate";
"Set URL" = "Set URL";

"Car Is Delivered" = "Car Is Delivered";
"Get Car" = "Get Car";

"Unable to connect to the Internet." = "Unable to connect to the Internet.";
"No server URL was entered." = "No server URL was entered.";
"Server communication error. Please check the URL." = "Server communication error. Please check the URL.";

"Activation Problem" = "Activation Problem";
"Deactivation Problem" = "Deactivation Problem";
"Login Problem" = "Login Problem";

"Please enter a username and password." = "Please enter a username and password.";
"Please enter a username." = "Please enter a username.";
"Please enter a password." = "Please enter a password.";

"No code was entered." = "No code was entered.";
"No email address was entered." = "No email address was entered.";

"Activation Code Sent" = "Activation Code Sent";
"Please check your email for the activation code." = "Please check your email for the activation code.";

"This device has been activated." = "This device has been activated.";
"This device has been deactivated." = "This device has been deactivated.";

"No Requests" = "No Requests";
"There are no requests in the system." = "There are no requests in the system.";
"User has logged onto another device" = "User has logged onto another device";

"CardApprovedButRequestFailed" = "Credit card approved and processed, but request transaction failed. Please request vehicle from workstation.";
"Transaction Denied" = "Transaction Denied";

"ScanEmployeeTitle" = "Scan Employee Number";
"ScanEmployeeMessage" = "Please scan your employee number.";

"Status: %@" = "Status: %@";

"Processing" = "Processing";
"Success" = "Success";
"Error" = "Error";
"Error: %d" = "Error: %d";

"RetryTransactionTitle" = "Retrying Arrival";
"Retry transaction lastError=%@" = "This arrival failed earlier with the message: \"%@.\" Please make corrections and save again.";

"RetryUserInterventionRequiredTitle" = "Internet Connection Required";
"RetryUserInterventionRequiredMessage" = "This transaction cannot be retried until your Internet connection is restored.";

"Invalid employee" = "Employee is not active.";

"TransactionQueuedTitle" = "Transaction Queued";
"TransactionQueuedMessage" = "This transaction will be processed once your Internet connection is restored.";

"SettingsNeedLocationsTitle" = "Waiting for Data";
"SettingsNeedLocationsMessage" = "The app is currently requesting data that's needed for this feature. Please try again in about 30 seconds.";

"%@\n%@" = "%@\n%@";
"Error: %d\n%@" = "Error: %d\n%@";
"No error code returned.\n%@" = "No error code returned.\n%@";
"Entry Error" = "Entry Error";
"Request Error" = "Request Error";

"BadTicketError(requiredLen=%d)" = "Valid ticket numbers are %d characters long.";
"NoSuchTicketError" = "Ticket # not in system";

"TicketRangeError(min=%d, max=%d)" = "Ticket number should be between %d and %d.";

"No Internet Connection" = "No Internet Connection";
"Entering offline mode" = "Entering offline mode";

"Internet Connection Required" = "Internet Connection Required";
"An Internet connection is required" = "An Internet connection is required to download required data.";

"Data Error" = "Data Error";
"The server returned unexpected data." = "The server returned unexpected data.";

"TicketArrivedTitle" = "Success";
"TicketArrivedMessage ticketID=%@" = "Ticket #%@ has been entered into the system.";
"TicketArrivalFailedTitle" = "Error";
"TicketArrivalFailedMessage ticketID=%@,reason=%@" = "Ticket #%@ could not be arrived. (%@)";

"TicketRequestedTitle" = "Success";
"TicketRequestedMessage ticketID=%@" = "Ticket #%@ has been requested.";
"TicketRequestFailedTitle" = "Error";
"TicketRequestFailedMessage ticketID=%@,reason=%@" = "Ticket #%@ could not be requested. (%@)";

"TicketDeliveredTitle" = "Success";
"TicketDeliveredMessage ticketID=%@" = "Ticket #%@ has been delivered.";
"TicketDeliveryFailedTitle" = "Error";
"TicketDeliveryFailedMessage ticketID=%@,reason=%@" = "Ticket #%@ could not be delivered. (%@)";

"RetagMainImageWarningTitle" = "Main Image Exists";
"RetagMainImageWarningMessage" = "A main image already exists. Do you want this to mark this as the main image instead?";

"every %d seconds" = "every %d seconds";

// Strings for Auto-order code.
"Ticket" = "Ticket";
"Type" = "Type";
"Employee" = "Employee";
"Reservation" = "Reservation";
"Space" = "Space";
"VIN" = "VIN";
"Plate" = "Plate";
"Name" = "Name";
"MMC" = "MMC";

"Color[%@] Make[%@] Model[%@]" = "%@ %@ %@";

"Auto" = "Auto";
"Manual" = "Manual";

"Set Automatic Order" = "Set Automatic Order";
"Set Arrival Data Order" = "Set Arrival Data Order";

"Select an option Title" = "Select Input Type";
"Select an option Message" = "Select the input type to use for this button.";

"Fixed button Title" = "Button Can't be Changed";
"Fixed button for %@" = "This button can only be used for %@.";

"InputTypeFor %d" = "InputType_%02d";
"InputType_00" = "None";
"InputType_01" = "Keyboard";
"InputType_02" = "Camera";
"InputType_03" = "Voice";
"InputType_04" = "Picker";
"InputType_05" = "Left Scroll";
"InputType_06" = "Right Scroll";

"No Internet Connection Available" = "No Internet Connection Available";
"Working Offline" = "Working Offline";
"An Internet connection is required to access this feature." = "An Internet connection is required to access this feature.";

"Log Out" = "Log Out";

"Scanning %@..." = "Scanning %@...";
"Server time: %@" = "Server time: %@";

"No Ticket" = "No Ticket";
"Ticket #%@" = "Ticket #%@";
"Temp Ticket Format (id=%@, t=%@)" = "TMP-%@-%@";
"Unit must be online to Generate Ticket" = "Unit must be online to Generate Ticket";

"Invalid Ticket Number" = "Invalid Ticket Number";
"Could Not Arrive Vehicle" = "Could Not Arrive Vehicle";
"Ticket is closed" = "The ticket entered is closed. The car has already been delivered.";
"TicketRangeError" = "The ticket number is not in a valid range.";

"SetArrivalGarageTitle" = "Configure Device Settings";
"SetArrivalGarageMessage" = "You cannot arrive vehicles until a default arrival garage has been set.";

"RateChangeSucceededTitle" = "Success";
"RateChangeSucceededMessage" = "Ticket change completed.";
"RateChangeFailedTitle" = "Error";
"RateChangeFailedMessage reason=%@" = "Unable to change ticket. %@";

"Ticket" = "Ticket";
"ArrivalData_00_00" = "Ticket";
"ArrivalData_00_01" = "VIP";
"ArrivalData_00_02" = "Employee";
"ArrivalData_00_03" = "Reservation";
"ArrivalData_00_04" = "Space";
"ArrivalData_00_05" = "VIN";
"ArrivalData_00_06" = "State";
"ArrivalData_00_07" = "Room";

"ArrivalData_01_00" = "Plate";
"ArrivalData_02_00" = "Name";
"ArrivalData_03_00" = "MMC";
"ArrivalData_04_00" = "Location";

"RequestData_00_00" = "Employee";
"RequestData_01_00" = "Location";
"RequestData_01_01" = "Main Entrance";
"RequestData_01_02" = "Side Entrance";
"RequestData_01_03" = "Front Gate";

"RequestData_02_00" = "Ticket";

"Change vehicle status to Retrieving?" = "Change vehicle status to \"Retrieving?\"";
"Change vehicle status to Delivered?" = "Change vehicle status to \"Delivered?\"";

"Request Status 0" = "Status: Unknown";
"Request Status 1" = "Status: Parking";
"Request Status 2" = "Status: Parked";
"Request Status 3" = "Status: Retrieving";
"Request Status 4" = "Status: Delivered";

/* Do not localize the following. */

// These are the Web Service calls, unobfuscated:
// 
// "Register(Email=%@, MAC=%@, Name=%@, Model=%@, iOSVersion=%@)" = "{\"Register\":{\"Email\":\"%@\",\"MAC\":\"%@\",\"Name\":\"%@\",\"Model\":\"%@\",\"iOSVersion\":\"%@\"}}";
// "Activation(Code=%@, MAC=%@)" = "{\"Activation\":{\"Code\":\"%@\",\"MAC\":\"%@\"}}";
// "Deactivation(MAC=%@, ActivationCode=%@, username=%@, employeeid=%@)" = "{\"Deactivation\":{\"MAC\":\"%@\",\"ActivationCode\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "Login(Username=%@, Password=%@, MAC=%@)" = "{\"Login\":{\"Username\":\"%@\",\"Password\":\"%@\",\"MAC\":\"%@\"}}";
// "RetrieveVehicleMakes(sessionid=%@, MAC=%@, makeid=%@, username=%@, employeeid=%@)" = "{\"RetrieveVehicleMakes\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"makeid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "RetrieveVehicleModels(sessionid=%@, MAC=%@, modelid=%@, username=%@, employeeid=%@)" = "{\"RetrieveVehicleModels\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"modelid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "RetrieveVehicleColors(sessionid=%@, MAC=%@, colorid=%@, username=%@, employeeid=%@)" = "{\"RetrieveVehicleColors\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"colorid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "RetrieveConfigItem(sessionid=%@, MAC=%@, configkey=%@, username=%@, employeeid=%@)" = "{\"RetrieveConfigItem\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"configkey\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "RetrieveRates(sessionid=%@, MAC=%@, rateid=%@, username=%@, employeeid=%@)" = "{\"RetrieveRates\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"rateid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "RetrieveGuestTypes(sessionid=%@, MAC=%@, guesttypeid=%@, username=%@, employeeid=%@)" = "{\"RetrieveGuestTypes\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"guesttypeid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "RetrieveDiscounts(sessionid=%@, MAC=%@, discountid=%@, username=%@, employeeid=%@)" = "{\"RetrieveDiscounts\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"discountid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "RetrieveLocations(sessionid=%@, MAC=%@, locationid=%@, username=%@, employeeid=%@)" = "{\"RetrieveLocations\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"locationid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "RetrieveGarages(sessionid=%@, MAC=%@, areaid=%@, username=%@, employeeid=%@)" = "{\"RetrieveGarages\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"areaid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}"; 
// "RetrieveRequests(sessionid=%@, MAC=%@, ptid=%@, parkedareaid=%@, username=%@, employeeid=%@)" = "{\"RetrieveRequests\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"ptid\":\"%@\",\"parkedareaid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "RetrieveImagesByPTID(sessionid=%@, MAC=%@, ptid=%@, username=%@, employeeid=%@)" = "{\"RetrieveImagesByPTID\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"ptid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "RetrieveImageByImageID(sessionid=%@, MAC=%@, imageid=%@, username=%@, employeeid=%@)" = "{\"RetrieveImageByImageID\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"imageid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}"; 
// "GetMyAssignedRequests(sessionid=%@, MAC=%@, username=%@, employeeid=%@)" = "{\"GetMyAssignedRequests\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "RetrieveEmployees(sessionid=%@, MAC=%@, username=%@, employeeid=%@)" = "{\"RetrieveEmployees\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}"; 
// "RetrieveReservations(sessionid=%@, MAC=%@, reservationid = %@, username=%@, employeeid=%@)" = "{\"RetrieveReservations\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"reservationid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}"; 
// "RequestVehicle(sessionid=%@, MAC=%@, requestdatetime=%@, requestby_eid=%@, request_lid=%@, ptid=%@, isHotelCheckout=%@, username=%@, employeeid=%@)" = "{\"RequestVehicle\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"requestdatetime\":\"%@\",\"requestby_eid\":\"%@\",\"request_lid\":\"%@\",\"ptid\":\"%@\",\"isHotelCheckout\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "LookupByTicketNumber(sessionid=%@, MAC=%@, ticketnumber=%@, username=%@, employeeid=%@)" = "{\"LookupByTicketNumber\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"ticketnumber\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "LookupByVIPNumber(sessionid=%@, MAC=%@, vipnumber=%@, username=%@, employeeid=%@)" = "{\"LookupByVIPNumber\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"vipnumber\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "LookupByLicensePlate(sessionid=%@, MAC=%@, licenseplate=%@, licenseplatestate=%@, username=%@, employeeid=%@)" = "{\"LookupByLicensePlate\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"licenseplate\":\"%@\",\"licenseplatestate\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "LookupByParkingTransID(sessionid=%@, MAC=%@, ptid=%@, username=%@, employeeid=%@)" = "{\"LookupByParkingTransID\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"ptid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "InsertOrUpdateTicket(sessionid=%@, MAC=%@, ptid=%@, ticketnumber=%@, vipnumber=%@, reservationnum=%@, spacenumber=%@, parkedareaid=%@, vin=%@, plate=%@, platestate=%@, roomnumber=%@, guestfirstname=%@, guestlastname=%@, mmc=%@, makeid=%@, modelid=%@, colorid=%@, location=%@, username=%@, employeeid=%@, arrivalby_eid=%@)" = "{\"InsertOrUpdateTicket\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"ptid\":\"%@\",\"ticketnumber\":\"%@\",\"vipnumber\":\"%@\",\"reservationnum\":\"%@\",\"spacenumber\":\"%@\",\"parkedareaid\":\"%@\",\"vin\":\"%@\",\"plate\":\"%@\",\"platestate\":\"%@\",\"roomnumber\":\"%@\",\"guestfirstname\":\"%@\",\"guestlastname\":\"%@\",\"mmc\":\"%@\",\"makeid\":\"%@\",\"modelid\":\"%@\",\"colorid\":\"%@\",\"location\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\",\"arrivalby_eid\":\"%@\"}}";
// "AddImage(sessionid=%@, MAC=%@, ptid=%@, imagecreationdatetime=%@, image=%@, ismain=%@, username=%@, employeeid=%@)" = "{\"AddImage\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"ptid\":\"%@\",\"imagecreationdatetime\":\"%@\",\"image\":\"%@\",\"ismain\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "SetTicketDateTimeByPTID(sessionid=%@, MAC=%@, ptidKey[%@]=dateTime[%@], ptid=%@, username=%@, employeeid=%@)" = "{\"SetTicketDateTimeByPTID\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"%@\":\"%@\",\"ptid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "AssignRequest(sessionid=%@, MAC=%@, ptid=%@, username=%@, employeeid=%@)" = "{\"AssignRequest\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"ptid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "GetNextRequest(sessionid=%@, MAC=%@, parkedareaid=%@, username=%@, employeeid=%@)" = "{\"GetNextRequest\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"parkedareaid\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "SendDeviceNotes(sessionid=%@, MAC=%@, notes=%@, employeeid=%@)" = "{\"SendDeviceNotes\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"notes\":\"%@\",\"employeeid\":\"%@\"}}";
// "SetAppPrefs(sessionid=%@, MAC=%@, preference=%@, employeeid=%@)" = "{\"SetAppPrefs\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"preference\":\"%@\",\"employeeid\":\"%@\"}}";
// "RetrieveAppPrefs(sessionid=%@, MAC=%@, username=%@, employeeid=%@)" = "{\"RetrieveAppPrefs\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "CalculateFee(sessionid=%@, MAC=%@, ptid=%@, requestdatetime=%@, discountids=%@, validationcodes=%@, username=%@, employeeid=%@)" = "{\"CalculateFee\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"ptid\":\"%@\",\"requestdatetime\":\"%@\",\"discountids\":%@,\"validationcodes\":%@,\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "ProcessCashPayment(sessionid=%@, MAC=%@, ptid=%@, requestdatetime=%@, requestby_eid=%@, request_lid=%@, paymentamount=%3.2f, discountids=%@, validationcodes=%@, isHotelCheckout=%@, email=%@, username=%@, employeeid=%@)" = "{\"ProcessCashPayment\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"ptid\":\"%@\",\"requestdatetime\":\"%@\",\"requestby_eid\":\"%@\",\"request_lid\":\"%@\",\"paymentamount\":\"%3.2f\",\"discountids\":%@,\"validationcodes\":%@,\"isHotelCheckout\":\"%@\",\"email\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "ProcessCreditCardPayment(sessionid=%@, MAC=%@, ptid=%@, requestdatetime=%@, requestby_eid=%@, request_lid=%@, paymentamount=%3.2f, discountids=%@, validationcodes=%@, CCName=%@, CCNumber=%@, CCExpDate=%@, CCTrack2=%@, CCAddress=%@, CCZipcode=%@, isHotelCheckout=%@, email=%@, username=%@, employeeid=%@)" = "{\"ProcessCreditCardPayment\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"ptid\":\"%@\",\"requestdatetime\":\"%@\",\"requestby_eid\":\"%@\",\"request_lid\":\"%@\",\"paymentamount\":\"%3.2f\",\"discountids\":%@,\"validationcodes\":%@,\"CCName\":\"%@\",\"CCNumber\":\"%@\",\"CCExpDate\":\"%@\",\"CCTrack2\":\"%@\",\"CCAddress\":\"%@\",\"CCZipcode\":\"%@\",\"isHotelCheckout\":\"%@\",\"email\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";
// "RetrieveUserFlags(Username=%@, Password=%@, MAC=%@)" = "{\"RetrieveUserFlags\":{\"Username\":\"%@\",\"Password\":\"%@\",\"MAC\":\"%@\"}}";
// InsertOrUpdateVariation for guestType & rate change. Sends all passed params.
// InsertOrUpdateVariation for guestType & rate change. normal insertorupdate+rate and guest type params.
// "DecodeVin(sessionid=%@, MAC=%@, username=%@, vin=%@)" = "{\"DecodeVin\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"username\":\"%@\",\"vin\":\"%@\"}}";
// "ProcessPostPayment(sessionid=%@, MAC=%@, requestdatetime=%@, requestby_eid=%@, request_lid=%@, discountids=%@, validationcodes=%@, isHotelCheckout=%@, ticketnumber=%@, reservationnumber=%@, guestname=%@, postingamount=%3.2f, email=%@, username=%@, postedby_employeeid=%@)" = "{\"ProcessPostPayment\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"requestdatetime\":\"%@\",\"requestbyeid\":\"%@\",\"request_lid\":\"%@\",\"discountids\":\"%@\",\"validationcodes\":\"%@\",\"isHotelCheckout\":\"%@\",\"ticketnumber\":\"%@\",\"reservationnumber\":\"%@\",\"guestname\":\"%@\",\"postingamount\":\"%3.2f\",\"email\":\"%@\",\"username\":\"%@\",\"postedby_employeeid\":\"%@\"}}";
// Minimal version:
// "ProcessPostPayment(sessionid=%@, MAC=%@, ticketnumber=%@, reservationnumber=%@, guestname=%@, postingamount=%3.2f, username=%@, postedby_employeeid=%@)" = "{\"ProcessPostPayment\":{\"sessionid\":\"%@\",\"MAC\":\"%@\",\"requestdatetime\":\"%@\",\"requestbyeid\":\"%@\",\"request_lid\":\"%@\",\"discountids\":%@,\"validationcodes\":%@,\"isHotelCheckout\":\"%@\",\"ticketnumber\":\"%@\",\"requestdatetime\":\"%@\",\"reservationnumber\":\"%@\",\"guestname\":\"%@\",\"postedby_employeeid\":\"%@\",\"postingamount\":\"%3.2f\",\"email\":\"%@\",\"username\":\"%@\",\"employeeid\":\"%@\"}}";

// The numbers down the left must match the webservice enums.

"01(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"02(%@:%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\"}}";
"03(%@:%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"04(%@:%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"05(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"06(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"07(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"08(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"09(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"10(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"11(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"12(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"13(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}"; 
"14(%@:%@,%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"15(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"16(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}"; 
"17(%@:%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"18(%@:%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}"; 
"19(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}"; 
"20(%@:%@,%@,%@,%@,%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"21(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"22(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"23(%@:%@,%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"24(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"25(%@:%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"26(%@:%@,%@,%@,%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"27(%@:%@,%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"28(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"29(%@:%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"30(%@:%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"31(%@:%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"32(%@:%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"33(%@:%@,%@,%@,%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":%@,\"%@\":%@,\"%@\":\"%@\",\"%@\":\"%@\"}}";
"34(%@:%@,%@,%@,%@,%@,%@,%f,%@,%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%3.2f\",\"%@\":%@,\"%@\":%@,\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"35(%@:%@,%@,%@,%@,%@,%@,%@,%@,%f,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%3.2f\",\"%@\":%@,\"%@\":%@,\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"36(%@:%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"37(%@:%@,%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",%@,\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"38(%@:%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"39(%@:%@,%@,%@,%@,%@,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"40(%@:%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%@,%f,%@,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":%@,\"%@\":%@,\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%3.2f\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\"}}";
"40(%@:%@,%@,%@,%@,%@,%f,%@,%@)" = "{\"%@\":{\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%@\",\"%@\":\"%3.2f\",\"%@\":\"%@\",\"%@\":\"%@\"}}";

/* DamagePix:
"Login(email=%@, password=%@, appID=%@, udid=%@, device=%@, osversion=%@)" = "{\"login\":{\"email\":\"%@\",\"password\":\"%@\",\"appid\":\"%@\",\"udid\":\"%@\",\"device\":\"%@\",\"osversion\":\"%@\"}}";
"Register(email=%@, password=%@, appID=%@)" = "{\"register\":{\"email\":\"%@\",\"password\":\"%@\",\"appid\":\"%@\"}}";
"RequestDPEntryID(sessionID=%@, plate=%@, state=%@, bCreateIfMissing=%@)" = "{\"requestDPEntryID\":{\"sessionid\":\"%@\",\"plate\":\"%@\",\"state\":\"%@\",\"bCreateIfMissing\":\"%@\"}}";
"AddDPImage(sessionID=%@, entryID=%@, datetime=%@, longitude=%@, latitude=%@, notes=%@, image=%@)" = "{\"addDPImage\":{\"sessionid\":\"%@\",\"entryid\":\"%@\",\"datetime\":\"%@\",\"longitude\":\"%@\",\"latitude\":\"%@\",\"notes\":\"%@\",\"image\":\"%@\"}}";
"RequestDPImageIDs(sessionID=%@, entryID=%@)" = "{\"requestDPImageIDs\":{\"sessionid\":\"%@\",\"entryid\":\"%@\"}}";
"RequestDPImage(sessionID=%@, entryID=%@, imageID=%@)" = "{\"requestDPImage\":{\"sessionid\":\"%@\",\"entryid\":\"%@\",\"imageid\":\"%@\"}}";
"RequestDPThumbnail(sessionID=%@, entryID=%@, imageID=%@)" = "{\"requestDPThumbnail\":{\"sessionid\":\"%@\",\"entryid\":\"%@\",\"imageid\":\"%@\"}}";
"EmailDPImages(sessionID=%@, entryID=%@, imageIDsJSONArray=%@, emailsJSONArray=%@)"  = "{\"emailDPImages\":{\"sessionid\":\"%@\",\"entryid\":\"%@\", \"imageids\":%@,\"emails\":%@}}";
"RecordDPPurchases(sessionID=%@, entryID=%@, imageIDsJSONArray=%@)"  = "{\"recordPurchases\":{\"sessionid\":\"%@\",\"entryid\":\"%@\", \"imageids\":%@}}";
*/
